app/controllers/countries_controller.rb

    def index
        @countries = Country.all
---
SELECT `countries`.* FROM `countries`

    def show
        @country = Country.find(params[:id])
---
SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1

    def create
        # Country.create(params.require(:country).permit(:name, :img, :info, :bestplase))
        # redirect_to countries_path
        @country = Country.new(params.require(:country).permit(:name, :img, :info))
        @country.user_id = current_user.id
        @country.save
---
INSERT INTO `countries` (`name`, `img`, `info`, `bestplase`, `created_at`, `updated_at`, `user_id`) VALUES ('whaaaaat', 'https://scx1.b-cdn.net/csz/news/800/2019/4-space.jpg', 'test1', 'test5', '2019-12-25 09:15:33.965454', '2019-12-25 09:15:33.965454', 1)

    def edit
        @country = Country.find(params[:id])
---
SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 13 LIMIT 1

    def update
        country = Country.find(params[:id])
        country.update(params.require(:country).permit(:name, :img, :info))
---
SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 7 LIMIT 1
UPDATE `countries` SET `countries`.`name` = 'New Zealand-', `countries`.`updated_at` = '2019-12-28 17:11:06.057991' WHERE `countries`.`id` = 7

    def destroy
        Country.find(params[:id]).destroy
---
DELETE FROM `countries` WHERE `countries`.`id` = 6
SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 6 LIMIT 1