app/controllers/places_controller.rb

SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
---
    def new
        @country = Country.find(params[:country_id])

SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
INSERT INTO `places` (`country_id`, `city`, `info`, `pic`, `vid`, `created_at`, `updated_at`) VALUES (1, 'test5', 'test5', 'https://www.alittihad.ae/assets/images/Articles/750x425/2018/10/20181018131725395RF.jpg', 'https://www.youtube.com/watch?v=r_qG-ArW9o4', '2019-12-25 04:16:08.368672', '2019-12-25 04:16:08.368672')
---
    def create
        puts params
        country = Country.find(params[:place][:country_id])
        Place.create(params.require(:place).permit(:city, :info, :pic, :vid, :country_id))

SELECT `places`.* FROM `places` WHERE `places`.`id` = 1 LIMIT 1
---
    def show
        @place = Place.find(params[:id])